Repository: Hamzeali/DH-Visualization
Catalog: lib/l10n/app_*.arb
Languages: de

# language
source: English
de: Deutsch

# skip
source: Skip intro
de: Einführung überspringen

# reset
source: Restart intro
de: Einführung neu starten

# errorTitel
source: Error
de: Fehler

# primeNumberErrorMessage
source: p must be prime number!
de: p muss eine Primzahl sein!

# primitiveRootErrorMessage
source: g must be primitive root of p!
de: g muss eine Primitivwurzel von p sein!

# emptyErrorMessage
source: Empty values are not accepted!
de: Leere Werte sind nicht erlaubt.

# doneTitel
source: Done
de: Erledigt

# correctMessage
source: The values have been set.
de: Die Werte sind gesetzt.

source: Settings
de: Einstellungen

source: Animation speed
de: Animations-Geschwindigkeit

# appLanguage
source: Language
de: Sprache

# zoomEnable
source: Enable zoom
de: Zoom aktivieren

source: Secret (Bob)
de: Geheim (Bob)

source: Secret (Alice)
de: Geheim (Alice)

source: Cancel
de: Abbrechen

# introStart
source: Start the Introduction
de: Starten Sie die Einführung

# aliceIntro
source: Hi! I am Alice.
de: Hi! Ich bin Alice.

# bobIntro
source: And I am Bob.
de: Und ich bin Bob.

# eveIntro
source: And here is Eve.
de: Und hier ist Eve.

# appDesc0
source: We (Alice and Bob) would like to communicate securely with each other and we want to use symmetric encryption (e.g. AES) to do so.
de: Wir (Alice und Bob) möchten sicher miteinander kommunizieren, und wir wollen dazu symmetrische Verschlüsselung (bspw. AES) benutzen.

# appDesc1
source: In this app we will explain to you how DHKE (Diffie-Hellman key-exchange) works.
de: In dieser App erklären wir Ihnen, wie DHKE (das Diffie-Hellman-Schlüsselaustausch-Verfahren) funktioniert.

# appDesc2
source: The application consists of 4 scenes.
de: Die Anwendung besteht aus 4 Szenen.

# firstScene
source: The first scene explains the basic idea of DHKE using colors.
de: Die erste Szene erklärt Ihnen die Grundidee von DHKE unter Verwendung von Farben.

# secondScene
source: The second scene explains some mathematical principles about one-way functions, primitive roots, and the discrete logarithm problem. You can also skip the first two scenes and go straight to scene 3.
de: Die zweite Szene erläutert einige mathematische Grundlagen über Einwegfunktionen, Primitivwurzeln und das Problem des diskreten Logarithmus. Die beiden ersten Szenen können Sie auch überspringen und gleich zu Szene 3 gehen.

# thirdScene
source: The third scene explains DHKE with numbers, where you can use your own numerical values as well :)
de: Die dritte Szene erklärt DHKE mit Zahlen, wobei Sie auch eigene Zahlenwerte verwenden können :)

# fourthScene
source: The fourth scene shows how a MitM attack on DHKE can be done (MitM = man-in-the-middle).
de: Die vierte Szene zeigt Ihnen, wie ein MitM-Angriff auf DHKE ausgeführt werden kann (MitM = Man-in-the-Middle).

# sceneStart1
source: So let's start the scenes...
de: Beginnen wir also mit den Szenen...

# sceneStart2
source: Start the scenes
de: Szenen starten

source: Secret
de: Geheimzahl

# toolTipRightBtn
source: Next step
de: Nächster Schritt

# toolTipLeftBtn
source: Previous step
de: Vorheriger Schritt

# toolTipMoreBtn
source: More
de: Mehr

# toolTipPlayBtn
source: Play
de: Abspielen

# toolTipResetBtn
source: Reset
de: Zurücksetzen

# toolTipSettingsBtn
source: Settings
de: Einstellungen

# toolTipDescBtn
source: Show description
de: Beschreibung anzeigen

# ref
source: References
de: Referenzen

# wiki
source: Diffie–Hellman key exchange:
de: Diffie-Hellman-Schlüsselaustausch:

# url
source: https://en.wikipedia.org/wiki/Diffie–Hellman_key_exchange
de: https://de.wikipedia.org/wiki/Diffie-Hellman-Schlüsselaustausch

# about0
source: What is DHKE?
de: Was ist DHKE?

# about1
source: - Purpose of the Diffie-Hellman key-exchange protocol
de: - Zweck des Diffie-Hellman Key-Exchange-Protokolls

# about2
source: Diffie-Hellman (DH for short) is a protocol that allows two parties to communicate securely with each other over an insecure channel (such as the internet). The main idea of DH is about using (asymmetric) keys and to establish a common key between the two parties, which then can be used for symmetric encryption. DH is no new protocol: It was invented by Whitfield Diffie and Martin Hellman in Stanford in 1976. DH can generate the secret key but cannot encrypt or decrypt messages. In the next section we will see in detail how this protocol works.
de: Diffie-Hellman (kurz DH) ist ein Protokoll, das es zwei Parteien ermöglicht, über einen unsicheren Kanal (wie das Internet) sicher miteinander zu kommunizieren. Die Hauptidee von DH besteht darin, (asymmetrische) Schlüssel zu nutzen und zwischen zwei Parteien einen gemeinsamen Schlüssel zu etablieren, der dann zur symmetrischen Verschlüsselung verwendet werden kann. DH ist kein neues Protokoll: Es wurde 1976 von Whitfield Diffie und Martin Hellman in Stanford erfunden. DH kann den geheimen Schlüssel generieren, aber keine Nachrichten verschlüsseln oder entschlüsseln. Im nächsten Abschnitt werden wir im Detail sehen, wie dieses Protokoll funktioniert.

# about3
source: - The Diffie-Hellman protocol
de: - Das Diffie-Hellman-Protokoll

# about4
source: Scenario: Alice and Bob want to communicate securely using a symmetric encryption scheme (and they have no PKI available). They are connected over an unsecured line and have not yet exchanged a key (so there is no information they share in advance).
de: Szenario: Alice und Bob wollen sicher mit einem symmetrischen Verschlüsselungsverfahren kommunizieren (und haben keine PKI zur Verfügung). Sie sind über eine ungesicherte Leitung verbunden und haben noch keinen Schlüssel ausgetauscht (es gibt also keine Informationen, die sie im voraus teilen).

# about5
source: The DH protocol makes it possible to establish a secret shared key between two parties – over the unsecured line. The security is based on the difficulty of the discrete logarithm problem.
de: Das DH-Protokoll ermöglicht es, einen geheimen gemeinsamen Schlüssel zwischen zwei Parteien zu erstellen – über die ungesicherte Leitung. Die Sicherheit beruht auf der Schwierigkeit des Problems des diskreten Logarithmus.

# about6
source: Alice and Bob use a one-way function to obtain a secret key S. This session key S can be used, for example, as a key in a symmetrical procedure such as AES for subsequent correspondence. This session key is only known to the two parties. How does the protocol work: Alice selects a random number 'a' and keeps it secret. She applies a one-way function to a to calculate the number A = g^a and sends it to Bob. He does the same, by selecting a secret random number 'b', calculating B = g^b and sending it to Alice. The number g is random and can be publicly known. Alice applies the one-way function together with her secret number a to B, while Bob does the same with his secret number b and the received number A.
de: Alice und Bob verwenden eine Einwegfunktion, um einen geheimen Schlüssel S zu erhalten. Dieser Sitzungsschlüssel (session key) kann z.B. als Schlüssel in einem symmetrischen Verfahren wie AES für die spätere Korrespondenz verwendet werden. Dieser Sitzungsschlüssel ist nur den beiden Parteien bekannt. Wie funktioniert das Protokoll: Alice wählt eine Zufallszahl 'a' und hält sie geheim. Sie wendet dann eine Einwegfunktion auf a an, um die Zahl A = g^a zu berechnen und sendet sie an Bob. Er tut dasselbe, indem er eine geheime Zufallszahl 'b' wählt, B = g^b berechnet und sie an Alice sendet. Die Zahl g ist zufällig und kann öffentlich bekannt sein. Alice wendet die Einwegfunktion zusammen mit ihrer Geheimzahl a auf B an, während Bob dasselbe mit seiner Geheimzahl b und der empfangenen Zahl A tut.

# about7
source: The result S is the same in each case because the one-way function is commutative: (g^a)^b = (g^b)^a. But even Bob cannot reconstruct Alice’s secret number a from the data available to him. And Alice cannot determine Bob’s secret number b. An eaves-dropper (Eve) who knows g and has intercepted both A and B cannot use this knowledge to determine a, b, or S.
de: Das Ergebnis S ist in jedem Fall dasselbe, da die Einwegfunktion kommutativ ist: (g^a)^b = (g^b)^a. Aber auch Bob kann Alices Geheimzahl a nicht aus den ihm zur Verfügung stehenden Daten rekonstruieren. Umgekehrt kann auch Alice Bobs Geheimzahl b nicht ermitteln. Und ein Lauscher (Eve), der g kennt und sowohl A als auch B abgehört hat, kann dieses Wissen nicht nutzen, um a, b oder S zu ermitteln.

# about8
source: Procedure:
de: Verfahren:

# about9
source: Alice and Bob want to negotiate a secret session key S via a channel that may be intercepted.
de: Alice und Bob wollen einen geheimen Sitzungsschlüssel S über einen Kanal aushandeln, der abgehört werden kann.

# about10
source: 1. They select a prime number p and a random number g (with 2 ≤ g ≤ p−2) and exchange this information openly.
de: 1. Sie wählen eine Primzahl p und eine Zufallszahl g (mit 2 ≤ g ≤ p-2) und tauschen diese Informationen offen aus.

# about11
source: 2. Alice now selects a random number a from {1,···,p−2}, and keeps it secret. Similarly, Bob selects a random number b, and keeps it secret.
de: 2. Alice wählt nun eine Zufallszahl a aus 1,...,p-2, und hält sie geheim. Analog dazu wählt Bob eine Zufallszahl b und hält sie geheim.

# about12
source: 3. Alice now calculates A = g^a (mod p).
de: 3. Alice berechnet nun A = g^a (mod p).

# about13
source: Bob calculates A = g^b (mod p).
de: Bob berechnet B = g^b (mod p).

# about14
source: 4. Alice sends the result A to Bob. Bob sends the result B to Alice.
de: 4. Alice sendet das Ergebnis A an Bob. Bob sendet das Ergebnis B an Alice.

# about15
source: So A and B can be considered public.
de: A und B können also als öffentlich angesehen werden.

# about16
source: 5. In order to determine the session key to be used by both parties, both separately calculate the following power modulo p:
de: 5. Um den von beiden Parteien zu verwendenden Sitzungsschlüssel zu ermitteln, berechnen beide Parteien getrennt voneinander die ff. Potenz modulo p:

# about17
source: Alice calculates S = B^a (mod p) and
de: Alice berechnet S = B^a (mod p) und

# about18
source: Bob calculates S = A^b (mod p).
de: Bob berechnet S = A^b (mod p).

# about19
source: Even if a spy (Eve) intercepts g, p, and the interim results A and B, she cannot use these in order to determine the session key used – due to the difficulty of calculating the discrete logarithm a = log(A).
de: Selbst wenn ein Spion (Eve) g, p und die Zwischenergebnisse A und B abfängt, kann er diese nicht verwenden, um den verwendeten Sitzungsschlüssel zu ermitteln - aufgrund der Schwierigkeit, den diskreten Logarithmus a = log(A) zu berechnen.

# about20
source: The DH problem and the man-in-the-middle
de: Das DH-Problem und der Man-in-the-Middle

# about21
source: Although the DHKE is considered to be one of the practical ways of generating a common secret key between two communicating parties, the basic Diffie-Hellman protocol is susceptible to a man-in-the-middle attack because it does not authenticate the communicating parties. The attacker can block the communication between the sender and the receiver and then take the role of the particular second party. In this scenario the attacker can get the public keys of each party and generate his own ones. Then a communication will be established between the attacker and the sender and another communication between the attacker and the receiver where each of the original communicating parties thinks he/she is communicating with the real partner. In this way the attacker can easily decrypt the secret message which has encrypted with these generated key.
de: Obwohl das DHKE-Protokoll als eine der praktischsten Methoden zur Erzeugung eines gemeinsamen geheimen Schlüssels zwischen zwei kommunizierenden Parteien gilt, ist das grundlegende Diffie-Hellman-Protokoll anfällig für einen Man-in-the-Middle-Angriff, da es die kommunizierenden Parteien nicht authentifiziert. Der Angreifer kann die Kommunikation zwischen dem Sender und dem Empfänger blockieren und dann die Rolle des jeweiligen Kommunikationspartners übernehmen. In diesem Szenario kann der Angreifer die öffentlichen Schlüssel der beiden Parteien erhalten und seine eigenen generieren. Dann wird eine Kommunikation zwischen dem Angreifer und dem Absender und eine weitere Kommunikation zwischen dem Angreifer und dem Empfänger aufgebaut, wobei jede der rsprünglichen kommunizierenden Parteien denkt, dass sie mit dem echten Partner kommuniziert. Auf diese Weise kann der Angreifer die geheime Nachricht, die mit diesen generierten Schlüsseln verschlüsselt wurde, leicht entschlüsseln.

source: Introduction
de: Einführung

# intro0
source: - What is primitive root modulo a prime number?
de: - Was ist die Primitivwurzel modulo einer Primzahl?

# intro1
source: • A primitive root
de: • Eine Primitivwurzel

# intro2
source: is a definite element of a prime residue class group with modulo
de: ist eine bestimmte Element einer primen Restklassengruppe mit Modulo

# intro3
source: . Any element can be generated by exponentiating a primitive root
de: . Mittels potenzieren einer Primitivwurzel

# intro6
source: • In other words we can call
de: • Mit anderen Worten können wir

# intro7
source: primitive root of the prime number
de: Primitivwurzel der Primzahl

# intro8
source: if
de: nennen, wenn

# intro9
source: are distinct.
de: verschieden sind.

# intro10
source: -> Example:
de: -> Beispiel:

# intro11
source: Let's assume that,
de: Nehmen wir an,

# intro12
source: and
de: und

# intro13
source: After calculating the modulus, we get:
de: Nach Berechnung des Moduls erhalten wir:

# intro14
source: As we see, all results are
de: Wie wir sehen, sind alle Ergebnisse

# intro15
source: dstinct
de: verschieden

# intro16
source: , so we can say that
de: , also können wir sagen, dass

# intro17
source: is a primitive root of the prime number
de: eine primitive Wurzel der Primzahl

# intro19
source: - Discrete logarithm problem
de: - Problem des diskreten Logarithmus

# intro20
source: In a finite group, the power (exponential function) y=b^x modulo p is easy to compute. The inverse x=log(b,y) is called the discrete logarithm. The discrete logarithm is difficult to calculate in a finite group. Thus, the exponential function is a one-way function (easy to calculate in one direction, hard in the other direction).
de: In einer endlichen Gruppe ist die Potenz (Exponentialfunktion) y=b^x modulo p einfach zu berechnen. Die Umkehrung x=log(b,y) nennt sich der diskrete Logarithmus. Er ist in einer endlichen Gruppe schwer zu berechnen. Somit ist die Exponentialfunktion eine Einwegfunktion (eine Richtung leicht, eine sehr schwer).

# intro21
source: exponential function
de: Exponentialfunktion

# intro22
source: is a
de: ist also eine

# intro23
source: one-way function.
de: Einwegfunktion.

# intro24
source: • But what is one-way function?
de: • Aber was ist eine Einwegfunktion?

# intro25
source: -> Assuming that we have data
de: -> Angenommen, wir haben Daten

# intro26
source: . it is easy to calculate
de: . es ist einfach

# intro27
source: . But it is very difficult to compute its inverse function.
de: zu berechnen. Aber es ist sehr schwierig, ihre Umkehrfunktion zu berechnen.

# intro28
source: Let's take:
de: Nehmen wir an:

# intro30
source: is easy, but when we want to compute the inverse function, it will be really hard.
de: zu berechnen ist einfach, aber wenn wir die Umkehrfunktion berechnen wollen, wird es wirklich schwierig.

# intro31
source: In other words, if we have
de: Mit anderen Worten, wenn wir

# intro32
source: , it will be very hard to know the value of
de: haben, wird es sehr schwierig sein, den Wert von

# intro33
source: . Where
de: zu bestimmen. wobei

# intro34
source: can be
de: könnte

# intro35
source: etc
de: usw sein

# intro36
source: - What is a generator?
de: - Was ist ein Erzeuger?

# intro37
source: A generator g of a group is an element that can be used to generate every other element in the group through repeated application of the group operation. In the case of a group of integers modulo a prime number p, the generator is raised to all possible powers from 1 to p-1, and these powers take all values of the other elements of the group (unequal zero) exactly once.
de: Ein Erzeuger g einer Gruppe ist ein Element, aus dem durch wiederholte Anwendung der Gruppenoperation jedes andere Element der Gruppe erzeugt werden kann. Im Fall einer Gruppe ganzer Zahlen modulo einer Primzahl p werden vom Erzeuger alle möglichen Potenzen hoch 1 bis p-1 gebildet, und diese Potenzen nehmen alle Werte der anderen Elemente der Gruppe genau einmal an.

# intro38
source: - Scenario of the scene
de: - Szenario der Szene

# intro39
source: This scene considers the multiplicative group modulo the prime p = 17. The group contains as elements all numbers from 1 to 16. As generator we choose g = 3. Then we can generate with the power g^i modulo p all elements of the group. The exponent i runs through all values from 1 to 16.
de: Diese Szene betrachtet die multiplikative Gruppe modulo der Primzahl p = 17. Die Gruppe enthält als Elemente alle Zahlen von 1 bis 16. Als Erzeuger wählen wir g = 3. Dann kann man mit der Potenz g^i modulo p alle Elemente der Gruppe erzeugen. Der Exponent i durchläuft alle Werte von 1 bis 16.

# dhke
source: What is DHKE?
de: Was ist DHKE?

# readDHKE
source: Read about DHKE?
de: Lesen Sie mehr über DHKE?

source: Yes
de: Ja

source: No
de: Nein

source: Suggest root
de: Wurzel vorschlagen

# showCase0
source: Go one step forward.
de: Gehen Sie einen Schritt nach vorne.

# showCase1
source: Go one step backward.
de: Gehen Sie einen Schritt zurück.

# showCase2
source: Show or hide the description box.
de: Blenden Sie das Beschreibungsfeld ein oder aus.

# showCase3
source: Change the settings of the application.
de: Ändern Sie die Einstellungen der Anwendung.

# showCase4
source: Reset the scene and start again.
de: Setzen Sie die Szene zurück und beginnen Sie von vorne.

# showCase5
source: Let the app run in automatic mode.
de: Lassen Sie die App im automatischen Modus laufen.

# showCase6
source: It has three buttons inside.
de: Darin befinden sich drei Knöpfe.

# showCase7
source: Step number. Each scene consists of several steps. You can also set this number directly
de: Schrittnummer. Jede Szene besteht aus mehreren Schritten. Sie können die Schrittnummer auch direkt eingeben.

# showCase8
source: In this box you will see some explanations about what happens on the screen. You can maximize or minimize the box pressing long.
de: In diesem Feld sehen Sie Erklärungen dazu, was auf dem Bildschirm passiert (das Feld können Sie durch langes Drücken maximieren oder minimieren).

# outOfRangeError
source: Please enter a valid number.
de: Bitte geben Sie eine gültige Nummer ein.

# goToStep
source: Go to step number:
de: Gehen Sie zu Schrittnummer:

# aboutApp
source: About...
de: Über...

# aboutApp1
source: The Flutter app 'DHKE' was developed in the course of a bachelor thesis by
de: Die Flutter-App 'DHKE' wurde im Zuge einer Bachelorarbeit von

# aboutApp2
source: for the CrypTool project.
de: für das CrypTool-Projekt entwickelt.

# aboutApp3
source: (C) 2023, freeware, open source (Apache 2), CrypTool (
de: (C) 2023, Freeware, Open-Source (gemäß Apache 2), CrypTool (

# aboutApp5
source: Last modification / built: 22.03.2023
de: Letzte Änderung / Built: 22.03.2023

# lastLeft
source: Beginning of the scene!
de: Anfang der Szene!

# lastLeft2
source: Beginning of the scene! Do you want to switch to the previous scene?
de: Anfang der Szene! Möchten Sie zur vorherigen Szene wechseln?

# lastRight
source: End of the scene! Do you want to switch to the next scene?
de: Ende der Szene! Möchten Sie zur nächsten Szene wechseln?

# lastRight2
source: End of the scene! Do you want to go back to the first scene?
de: Ende der Szene! Möchten Sie zur ersten Szene zurückkehren?

# slide1
source: Basic idea of DHKE
de: Grundlegende Idee des DHKE

# slide2
source: Some mathematical basics
de: Mathematische Grundlagen

# slide3
source: How does the DHKE protocol work?
de: Wie funktioniert das DHKE-Protokoll?

# slide4
source: MitM attack on DHKE
de: MitM-Angriff auf DHKE

# text1
source: Color mixing is a simple analogy used to illustrate the Diffie-Hellman key exchange (DHKE) protocol. The aim is, that Alice and Bob agree on a secret color. And in scene 3, we’ll see how it works with numbers.
de: Farbmischungen sind eine einfache Analogie, mit der man das Diffie-Hellman Schlüsselaustausch-Protokoll (DHKE) veranschaulichen kann. Ziel ist es, dass Alice und Bob sich auf eine geheime Farbe einigen. Und in Szene 3 sehen wir dann, wie es mit Zahlen funktioniert.

# text2
source: Choosing a prime number p and a generator g.
de: Wahl einer Primzahl p und eines Erzeugers g.

# prevOp
source: Previous operation:
de: Vorherige Operation:

# newOp
source: New operation:
de: Neue Operation:

# text31
source: This time with numbers – with small numbers. In practice, DHKE uses large numbers (p > 3000 bit according to BSI recommendations)
de: Diesmal mit Zahlen – mit kleinen Zahlen. In der Praxis verwendet DHKE große Zahlen (p > 3000 bit laut BSI-Empfehlung).

# text321
source: Alice chooses a prime number. Let’s say she chooses p =
de: Alice wählt eine Primzahl. Nehmen wir an, sie wählt p =

# text322
source: and as generator g =
de: und als Erzeuger g =

# text4
source: Man-in-the-middle attack on DHKE: Eve blocks the key exchange between Alice and Bob.
de: Man-in-the-Middle-Angriff auf DHKE: Eve blockiert den Schlüsselaustausch zwischen Alice und Bob.

# slide1Item0
source: Alice thinks up her first color (yellow).
de: Alice denkt sich ihre erste Farbe (gelb) aus.

# slide1Item1
source: When Alice sends Bob her first color (which is the 'generator' in the real protocol), Eve can listen and so she also knows this color.
de: Als Alice Bob die erste Farbe schickt (die im echten Protokoll der 'Erzeuger' ist), kann Eve zuhören und kennt so diese Farbe auch.

# slide1Item2
source: Now both think up of another (secret) color: Alice selects red and Bob selects turquoise.
de: Nun denken sich beide noch eine weitere (geheime) Farbe aus: Alice wählt rot und Bob wählt türkis.

# slide1Item3
source: Alice and Bob mix Alice's first color (yellow) with the color, they respectively thought about the second time. Now, Alice and Bob both have a mixed color (Alice has orange, Bob has blue).
de: Alice und Bob mischen die erste Farbe von Alice (gelb) jeweils mit der Farbe, die sie sich als Zweites ausdachten. Jetzt haben Alice und Bob jeweils eine Mischfarbe (Alice hat orange, Bob hat blau).

# slide1Item4
source: Alice sends her mixed color (orange) to Bob, and Bob sends his mixed color (blue) to Alice. Eve can know the mixed color of both, but not the their secret colors (red and turquoise).
de: Alice sendet ihre Mischfarbe (orange) an Bob, und Bob sendet seine Mischfarbe (blau) an Alice. Eve kennt nun auch die Mischfarbe von beiden, aber nicht die geheimen Farben (rot und türkis).

# slide1Item5
source: Alice mixes Bob's mixed color (blue) with her secret color (red). Bob does the same: He mixes Alice's mixed color (orange) with his second color (blue).
de: Alice mischt Bobs Mischfarbe (blau) mit ihrer geheimen Farbe (rot). Bob macht dasselbe: Er mischt Alices Mischfarbe (orange) mit seiner zweiten Farbe (türkis).
