Repository: Hamzeali/DH-Visualization
Catalog: lib/l10n/app_*.arb
Languages: de

# slide1Item6
source: Now, Alice and Bob have the same result color (dark green), of which Eve has no idea. Transferred to the upcoming DHKE, Alice and Bob now share a secret (the result color) of which Eve has no clue about, although she was able to record everything the both communicated about.
de: Jetzt haben Alice und Bob die gleiche Ergebnisfarbe (dunkelgrün), von der Eve keine Ahnung hat. Übertragen auf das kommende DHKE teilen Alice und Bob nun ein Geheimnis (die Ergebnisfarbe), von dem Eve keine Ahnung hat, obwohl sie alles mitschneiden konnte, worüber die beiden kommunizierten.

# slide3Item0
source: Alice chooses a large prime number p and a generator g. Here we will use only small numbers for clarification.
de: Alice wählt eine große Primzahl p und einen Erzeuger g. Hier nutzen wir zur Verdeutlichung nur kleine Zahlen.

# slide3Item1
source: Alice sends p and g to Bob. So Eve will know the selected numbers.
de: Alice sendet p und g an Bob. Eve kennt damit die ausgewählten Zahlen.

# slide3Item2
source: Alice selects her secret number 'a'. Bob also selects his secret number 'b'. The secret numbers (private keys) will not be exchanged!
de: Alice wählt ihre Geheimzahl 'a'. Auch Bob wählt seine Geheimzahl 'b' aus. Die Geheimzahlen (private Schlüssel) werden nicht ausgetauscht!

# slide3Item3
source: Now Alice and Bob generate their public key ('A' for Alice and 'B' for Bob) with the help of the formula shown on the screen.
de: Jetzt generieren Alice und Bob ihren öffentlichen Schlüssel ('A' für Alice und 'B' für Bob) mit Hilfe der Formel, die auf dem Bildschirm zu sehen ist.

# slide3Item4
source: Alice and Bob exchange the values of their public keys (A and B). Again, Eve can intercept these two values.
de: Alice und Bob tauschen die Werte ihrer öffentlichen Schlüssel (A und B) aus. Wieder kann Eve diese beiden Werte abhören.

# slide3Item5
source: Now, Alice and Bob generate the shared secret key S – using the formulas shown on the screen. This means that they have a shared secret. They now can use this secret number as a session key for a symmetric encryption.
de: Jetzt generieren Alice und Bob den gemeinsamen geheimen Schlüssel S – mit den auf dem Bildschirm angezeigten Formeln. Damit haben sie ein gemeinsames Geheimnis. Diese geheime Zahl können sie nun als Schlüssel (Sessionkey) für eine symmetrische Verschlüsselung verwenden.

# slide4Item0
source: Alice selects her secret number a.
de: Alice wählt ihre Geheimzahl a.

# slide4Item1
source: Alice generates her public key A with the help of the formula shown on the screen.
de: Alice generiert ihren öffentlichen Schlüssel A mit Hilfe der Formel, die auf dem Bildschirm angezeigt wird.

# slide4Item2
source: Now Alice wants to share her public key A with Bob. Eve blocks the transmission of Alice's public key and keeps it for herself without Alice or Bob noticing that.
de: Jetzt will Alice ihren öffentlichen Schlüssel A mit Bob teilen. Eve blockiert die Übertragung von Alices öffentlichem Schlüssel und behält ihn für sich, ohne dass Alice oder Bob dies bemerken.

# slide4Item3
source: Eve selects her first secret number e1.
de: Eve wählt ihre erste Geheimzahl e1.

# slide4Item4
source: Eve generates her public key EA with the help of the formula shown on the screen.
de: Eve generiert ihren öffentlichen Schlüssel EA mit Hilfe der Formel, die auf dem Bildschirm angezeigt wird.

# slide4Item5
source: Now Eve shares her public key EA with Alice. Alice thinks that this public key is coming from Bob.
de: Nun teilt Eve ihren öffentlichen Schlüssel EA mit Alice. Alice denkt, dass dieser öffentliche Schlüssel von Bob kommt.

# slide4Item6
source: Now Alice and Eve generate the secret key S1 with the help of the formulas shown on the screen.
de: Nun generieren Alice und Eve den geheimen Schlüssel S1 mit Hilfe der auf dem Bildschirm angezeigten Formeln.

# slide4Item7
source: Bob selects his secret number b.
de: Bob wählt seine Geheimzahl b.

# slide4Item8
source: Bob generates his public key B with the help of the formula that's shown on the screen.
de: Bob generiert seinen öffentlichen Schlüssel B mit Hilfe der Formel, die auf dem Bildschirm angezeigt wird.

# slide4Item9
source: Now Bob wants to share his public key B with Alice. Eve blocks the transmission of Bob's public key and keeps it for herself without letting Alice or Bob notice that.
de: Nun will Bob seinen öffentlichen Schlüssel B mit Alice teilen. Eve blockiert die Übertragung von Bobs öffentlichem Schlüssel und behält ihn für sich, ohne dass Alice oder Bob dies bemerken.

# slide4Item10
source: Eve selects her second secret number e2.
de: Eve wählt ihre zweite Geheimzahl e2.

# slide4Item11
source: Eve generates her public key EB with the help of the formula shown on the screen.
de: Eve generiert ihren öffentlichen Schlüssel EB mit Hilfe der Formel, die auf dem Bildschirm angezeigt wird.

# slide4Item12
source: Now Eve shares her public key EB with Bob. Bob thinks that this public key is coming from Alice.
de: Jetzt teilt Eve ihren öffentlichen Schlüssel EB mit Bob. Bob denkt, dass dieser öffentliche Schlüssel von Alice kommt.

# slide4Item13
source: Now Bob and Eve generate the secret key S2 with the help of the formulas shown on the screen.
de: Nun generieren Bob und Eve den geheimen Schlüssel S2 mit Hilfe der auf dem Bildschirm angezeigten Formeln.

# slide4Item14
source: If Eve manages to continue to stop direct communication between Alice and Bob, and channel it through her, she will be able to read all communication.
de: Wenn Eve es schafft, die direkte Kommunikation zwischen Alice und Bob weiterhin zu unterbinden und über sich zu lenken, kann sie die gesamte Kommunikation mitlesen.

# slide4Item15
source: Now we show how a simple DHKE can be attacked.
de: Nun wird gezeigt, wie ein einfacher DHKE angegriffen werden kann.
